In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [3]:
np.random.randn(6,4)

array([[-0.04674175,  0.58163136,  0.46784538, -0.41759932],
       [-1.20999956,  1.23362246,  0.73872731, -0.86340311],
       [-0.71212235, -0.83660296, -1.26633051,  0.89509195],
       [ 0.49629429,  1.43329579,  0.86684915,  0.10913976],
       [-0.92201837,  2.08582841,  2.02663638, -0.05339001],
       [-0.58521401, -1.15359549,  0.15314144, -0.99776673]])

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.646592  0.607699 -0.853339  0.209221
2013-01-02 -0.736000  0.763487  0.101655  0.132013
2013-01-03 -0.249651  1.188391 -0.075620 -0.593801
2013-01-04  0.339841  0.497959 -0.145016 -1.749556
2013-01-05 -1.206740 -0.569501  1.610710  1.065205
2013-01-06  1.845376  0.098606  0.088267  0.126327

In [7]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.106570  0.431107  0.121109 -0.135098
std    1.089136  0.605208  0.809869  0.950354
min   -1.206740 -0.569501 -0.853339 -1.749556
25%   -0.614413  0.198444 -0.127667 -0.413769
50%    0.045095  0.552829  0.006323  0.129170
75%    0.569904  0.724540  0.098308  0.189919
max    1.845376  1.188391  1.610710  1.065205

In [9]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.209221 -0.853339  0.607699  0.646592
2013-01-02  0.132013  0.101655  0.763487 -0.736000
2013-01-03 -0.593801 -0.075620  1.188391 -0.249651
2013-01-04 -1.749556 -0.145016  0.497959  0.339841
2013-01-05  1.065205  1.610710 -0.569501 -1.206740
2013-01-06  0.126327  0.088267  0.098606  1.845376

In [11]:
df.sort_values('C').sort_values(by='A')

                   A         B         C         D
2013-01-05 -1.206740 -0.569501  1.610710  1.065205
2013-01-02 -0.736000  0.763487  0.101655  0.132013
2013-01-03 -0.249651  1.188391 -0.075620 -0.593801
2013-01-04  0.339841  0.497959 -0.145016 -1.749556
2013-01-01  0.646592  0.607699 -0.853339  0.209221
2013-01-06  1.845376  0.098606  0.088267  0.126327

In [14]:
df2 = df
df2.iloc[0:2,1:3] = 100
df2

                   A           B           C         D
2013-01-01  0.646592  100.000000  100.000000  0.209221
2013-01-02 -0.736000  100.000000  100.000000  0.132013
2013-01-03 -0.249651    1.188391   -0.075620 -0.593801
2013-01-04  0.339841    0.497959   -0.145016 -1.749556
2013-01-05 -1.206740   -0.569501    1.610710  1.065205
2013-01-06  1.845376    0.098606    0.088267  0.126327

In [15]:
df

                   A           B           C         D
2013-01-01  0.646592  100.000000  100.000000  0.209221
2013-01-02 -0.736000  100.000000  100.000000  0.132013
2013-01-03 -0.249651    1.188391   -0.075620 -0.593801
2013-01-04  0.339841    0.497959   -0.145016 -1.749556
2013-01-05 -1.206740   -0.569501    1.610710  1.065205
2013-01-06  1.845376    0.098606    0.088267  0.126327

In [16]:
df3 = df.copy()
df3.iloc[0:2,1:3] = 500
df3

                   A           B           C         D
2013-01-01  0.646592  500.000000  500.000000  0.209221
2013-01-02 -0.736000  500.000000  500.000000  0.132013
2013-01-03 -0.249651    1.188391   -0.075620 -0.593801
2013-01-04  0.339841    0.497959   -0.145016 -1.749556
2013-01-05 -1.206740   -0.569501    1.610710  1.065205
2013-01-06  1.845376    0.098606    0.088267  0.126327

In [17]:
df

                   A           B           C         D
2013-01-01  0.646592  100.000000  100.000000  0.209221
2013-01-02 -0.736000  100.000000  100.000000  0.132013
2013-01-03 -0.249651    1.188391   -0.075620 -0.593801
2013-01-04  0.339841    0.497959   -0.145016 -1.749556
2013-01-05 -1.206740   -0.569501    1.610710  1.065205
2013-01-06  1.845376    0.098606    0.088267  0.126327

## Map

In [21]:
df = pd.DataFrame([[4,9]]*3, columns=['A','B'])

In [18]:
[[4,9]]*3

[[4, 9], [4, 9], [4, 9]]

In [22]:
type(df['A']),type(df.A)

(pandas.core.series.Series, pandas.core.series.Series)

In [23]:
df.A.map(lambda x : x**2+2*x+1)

0    25
1    25
2    25
Name: A, dtype: int64

In [24]:
s = pd.Series(['cat','dog',np.nan,'rabbit'])
df = pd.DataFrame({'pet':s})
df

      pet
0     cat
1     dog
2     NaN
3  rabbit

In [25]:
df['babby'] = df.pet.map({'cat':'kitten','dog':'puppy'})
df

      pet   babby
0     cat  kitten
1     dog   puppy
2     NaN     NaN
3  rabbit     NaN

In [27]:
df['I am'] = df.pet.map('I am a {}'.format, na_action='ignore')
df

      pet   babby           I am
0     cat  kitten     I am a cat
1     dog   puppy     I am a dog
2     NaN     NaN            NaN
3  rabbit     NaN  I am a rabbit

## Apply

In [28]:
df = pd.DataFrame([[4,9]]*3, columns=['A','B'])

In [32]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [35]:
df.apply(np.sum)

A    12
B    27
dtype: int64

In [36]:
df['sum'] = df.apply(np.sum, axis=1)
df

   A  B  sum
0  4  9   13
1  4  9   13
2  4  9   13

## Applymap

In [38]:
df = pd.DataFrame([[1,2.2],[3.356,4.567]])
df

       0      1
0  1.000  2.200
1  3.356  4.567

In [39]:
df.applymap(lambda x : len(str(x)))

   0  1
0  3  3
1  5  5

In [40]:
df ** 2

           0          1
0   1.000000   4.840000
1  11.262736  20.857489

In [41]:
df.pow(2)

           0          1
0   1.000000   4.840000
1  11.262736  20.857489